<p>Esta actividad de trabajo aut&oacute;nomo te permitir&aacute; <strong>aplicar los conceptos de la Semana 2: Requerimientos, Elicitaci&oacute;n y Documento SRS</strong> al proyecto de aplicaci&oacute;n m&oacute;vil definido en la asignatura de <strong>Programaci&oacute;n M&oacute;vil</strong> con el <strong>Mgtr. Richard Armijos</strong>.</p>
<p>A partir del proyecto asignado, deber&aacute;s: <em>identificar stakeholders</em>, <em>definir actores</em>, <em>delimitar el alcance</em> y <em>redactar un borrador inicial de Requerimientos Funcionales (RF) y No Funcionales (RNF)</em>, siguiendo la l&oacute;gica de un <strong>SRS b&aacute;sico</strong> presentada en clase.</p>
<p><strong>&iquest;Qu&eacute; realizar&aacute;s?</strong></p>
<div class="_tableContainer_1rjym_1">
    <div class="group _tableWrapper_1rjym_13 flex w-fit flex-col-reverse">
        <table class="w-fit min-w-(--thread-content-width)" style="border-collapse: collapse; width: 100%;" border="1">
            <thead>
                <tr>
                    <th style="width: 22%;">Componente</th>
                    <th style="width: 53%;">Instrucciones espec&iacute;ficas</th>
                    <th style="width: 25%;">Criterios de calidad</th>
                </tr>
            </thead>
            <tbody>
                <tr>
                    <td><strong>1. Portada y contexto</strong></td>
                    <td>Incluye: nombre oficial del proyecto (seg&uacute;n Programaci&oacute;n M&oacute;vil), nombres de integrantes del grupo, docente, fecha y una breve descripci&oacute;n (2&ndash;3 l&iacute;neas) del problema que la app busca resolver.</td>
                    <td>Datos completos, ordenados y coherentes con el proyecto real.</td>
                </tr>
                <tr>
                    <td><strong>2. Stakeholders del proyecto</strong></td>
                    <td>Identifica +<strong>6 stakeholders</strong> clave (personas o entidades interesadas): cliente, usuarios finales, negocio/instituci&oacute;n, &aacute;rea de TI, docente gu&iacute;a, etc. Para cada uno indica:
                        <ul>
                            <li>Qui&eacute;n es (tipo de stakeholder).</li>
                            <li>Qu&eacute; necesita o espera de la aplicaci&oacute;n.</li>
                            <li>C&oacute;mo se ve afectado o beneficiado.</li>
                        </ul>
                    </td>
                    <td>Stakeholders relevantes, conectados con el contexto real del proyecto (no gen&eacute;ricos).</td>
                </tr>
                <tr>
                    <td><strong>3. Actores / Usuarios</strong></td>
                    <td>Define los actores que interact&uacute;an directamente con la app (ej.: usuario final, administrador, repartidor, docente, etc.). Describe en 1&ndash;2 l&iacute;neas qu&eacute; hace cada actor dentro del sistema.</td>
                    <td>Relaci&oacute;n clara entre actores, stakeholders y funcionalidades.</td>
                </tr>
                <tr>
                    <td><strong>4. Alcance del sistema (MVP)</strong></td>
                    <td>Especifica entre <strong>4 y 6 puntos</strong> sobre lo que la app <strong>S&Iacute; har&aacute;</strong> en la primera versi&oacute;n (MVP) y, si aplica, menciona brevemente lo que <strong>NO incluye</strong> todav&iacute;a.</td>
                    <td>Alcance realista, alineado con Programaci&oacute;n M&oacute;vil y sin ambig&uuml;edades.</td>
                </tr>
                <tr>
                    <td><strong>5. Requerimientos Funcionales (RF)</strong></td>
                    <td>Redacta al menos <strong>8 RF</strong> espec&iacute;ficos usando el formato: <em>RF-01: El sistema permitir&aacute; / deber&aacute;...</em><br />Basados en las necesidades de stakeholders, actores y alcance definido.</td>
                    <td>Claros, numerados, verificables, sin mezclar varias cosas en un solo requerimiento.</td>
                </tr>
                <tr>
                    <td><strong>6. Requerimientos No Funcionales (RNF)</strong></td>
                    <td>Redacta al menos <strong>4 RNF</strong> relacionados con: rendimiento, seguridad, usabilidad, compatibilidad, disponibilidad, etc. Usa el formato: <em>RNF-01: La aplicaci&oacute;n deber&aacute;...</em> con criterios medibles (tiempos, porcentajes, l&iacute;mites).</td>
                    <td>Coherentes con una app m&oacute;vil real (no frases vagas tipo &ldquo;ser&aacute; segura&rdquo; sin m&eacute;tricas).</td>
                </tr>
                <tr>
                    <td><strong>7. Fuentes / Elicitaci&oacute;n</strong></td>
                    <td>En 3&ndash;5 l&iacute;neas indica <strong>c&oacute;mo definiste esos requerimientos</strong>: supuestos, entrevistas r&aacute;pidas, an&aacute;lisis del contexto, benchmark de apps similares, etc. (Conecta con lo visto sobre t&eacute;cnicas de elicitaci&oacute;n).</td>
                    <td>Evidencia de reflexi&oacute;n, no solo copia te&oacute;rica.</td>
                </tr>
                <tr>
                    <td><strong>8. Redacci&oacute;n y presentaci&oacute;n</strong></td>
                    <td>Usa secciones numeradas, lenguaje simple y t&eacute;cnico, sin p&aacute;rrafos recargados. Mant&eacute;n consistencia entre stakeholders, actores, RF y RNF.</td>
                    <td>Documento limpio, ordenado y alineado al esquema SRS b&aacute;sico visto en clase.</td>
                </tr>
            </tbody>
        </table>
    </div>
</div>
<p><strong>Estructura sugerida del borrador SRS (TA-1.2):</strong></p>
<ul>
    <li>1. Introducci&oacute;n y contexto.</li>
    <li>2. Stakeholders del proyecto.</li>
    <li>3. Actores / Usuarios.</li>
    <li>4. Alcance del sistema (MVP).</li>
    <li>5. Requerimientos Funcionales (RF-01, RF-02, ...).</li>
    <li>6. Requerimientos No Funcionales (RNF-01, RNF-02, ...).</li>
    <li>7. Fuentes y t&eacute;cnicas de elicitaci&oacute;n usadas.</li>
</ul>
<p><strong>Importante:</strong> Todo debe basarse en el <strong>proyecto</strong>&nbsp;trabajado con el <strong>Mgtr. Richard Armijos</strong>. No inventes un proyecto distinto ni uses ejemplos gen&eacute;ricos.</p>
<p><strong>Especificaciones t&eacute;cnicas de entrega</strong></p>
<div class="_tableContainer_1rjym_1">
    <div class="group _tableWrapper_1rjym_13 flex w-fit flex-col-reverse">
        <table class="w-fit min-w-(--thread-content-width)" style="border-collapse: collapse; width: 100%;" border="1">
            <thead>
                <tr>
                    <th style="width: 25%;">Aspecto</th>
                    <th style="width: 75%;">Especificaci&oacute;n requerida</th>
                </tr>
            </thead>
            <tbody>
                <tr>
                    <td><strong>Plantilla a usar</strong></td>
                    <td><a class="instructure_file_link instructure_scribd_file inline_disabled" title="Borrador SRS.docx" href="https://uide.instructure.com/courses/30172/files/9484802?wrap=1" target="_blank" rel="noopener" data-canvas-previewable="false" data-api-endpoint="https://uide.instructure.com/api/v1/courses/30172/files/9484802" data-api-returntype="File">Borrador SRS.docx</a></td>
                </tr>
                <tr>
                    <td><strong>Formato de archivo</strong></td>
                    <td>PDF &uacute;nicamente. Nomenclatura: <strong>TA-1.2_ApellidoNombre_SRS-Borrador.pdf</strong></td>
                </tr>
                <tr>
                    <td><strong>Originalidad</strong></td>
                    <td>Trabajo original, alineado al proyecto real. M&aacute;ximo <strong>40% de apoyo</strong> con herramientas de IA.</td>
                </tr>
            </tbody>
        </table>
    </div>
</div>
<p><strong>Informaci&oacute;n importante</strong></p>
<ul>
    <li><strong>Modalidad:</strong> Trabajo aut&oacute;nomo individual &mdash; <strong>2.25 pts</strong>.</li>
    <li><strong>Penalizaci&oacute;n por retraso:</strong> -0.25 puntos por cada d&iacute;a de retraso.</li>
</ul>
<p>Si tienes dudas sobre c&oacute;mo formular RF/RNF, identificar stakeholders o estructurar tu SRS, revisa la <strong>Presentaci&oacute;n Semana 2: Requerimientos y Elicitaci&oacute;n</strong> y utiliza el <strong>horario de tutor&iacute;as</strong> o el <strong>correo institucional</strong>.</p>